tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

brew "aspell"
brew "cmake"
brew "fd"
brew "fzf"
brew "git"
brew "git-gui"
brew "git-lfs"
brew "htop"
brew "md5sha1sum", link: false
brew "qemu"
brew "ripgrep"
brew "rust"
brew "sshfs"
brew "subversion"
brew "tig"
brew "tmux"
brew "tree"

cask "emacs"
brew "macvim"

# Python staff.
brew "ipython"
brew "jupyterlab"
brew "flake8"
brew "black"

# Static website generator.
brew "hugo"

cask "font-anonymice-powerline"
cask "font-consolas-for-powerline"
cask "font-dejavu-sans-mono-for-powerline"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code"
cask "font-inconsolata-dz-for-powerline"
cask "font-inconsolata-g-for-powerline"
cask "font-input"
cask "font-lato"
cask "font-merriweather"
cask "font-meslo-for-powerline"
cask "font-pt-sans"
cask "font-roboto-mono-for-powerline"
cask "font-sf-mono-for-powerline"
cask "font-source-code-pro-for-powerline"
cask "font-ubuntu-mono-derivative-powerline"

cask "meld"
cask "osxfuse"
